docs: readme architecture
